In [142]:
# This is joaquin Osio's Pandas Homework

In [63]:
import pandas as pd

In [64]:
file = "Resources/02-Homeworks_04-Pandas_Instructions_HeroesOfPymoli_Resources_purchase_data.csv"

In [65]:
df = pd.read_csv(file, encoding="ISO-8859-1")

In [66]:
# Preview of the DataFrame
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [67]:
# Total Number of Players
df['SN'].nunique()

576

In [68]:
# Number of Unique Items
df_unique = df['Item ID'].nunique()
df_unique

179

In [69]:
# Average Purchase Price
df["Price"].mean()

3.0509871794871795

In [70]:
# Total Number of Purchases
df["Purchase ID"].count()

780

In [71]:
# Total Revenue
df["Price"].sum()

2379.77

In [72]:
# Percentage of Male Female Player and Other
df['Gender'].value_counts(normalize=True) * 100

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

In [73]:
# Percentage of Male Female Player and Other
df['Gender'].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [74]:
#The below each broken by gender
df_group = df.groupby("Gender")

In [75]:
# Purchase Count
purchases_gender = pd.DataFrame(df_group["Purchase ID"].count())
purchases_gender

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [76]:
# Average Purchase Price
avg_price_gender = pd.DataFrame(df_group["Price"].mean())
avg_price_gender

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [77]:
# Total Purchase Value
total_price_gender = pd.DataFrame(df_group["Price"].sum())
total_price_gender

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [78]:
# Average Purchase Total per Person by Gender
df_group_person_gender = df.groupby(['Gender', 'SN'])
total_total_avg = pd.DataFrame(df_group_person_gender["Price"].mean())
total_total_avg

                                     Price
Gender                SN
Female                Adastirin33    4.480
                      Aerithllora36  4.320
                      Aethedru70     3.540
                      Aidain51       3.450
                      Aiduesu86      4.480
...                                    ...
Other / Non-Disclosed Lirtim36       1.330
                      Maluncil97     2.640
                      Rairith81      2.220
                      Siarithria38   3.455
                      Sundim98       4.750

[576 rows x 1 columns]

In [109]:
# The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
# Purchase Count
bins = [0, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 100]
bin_labels=["<10","10-14","15-19","20-24","25,29","30-34","35-39","40-44","45-49","50-54","55-59",">60"]
pd.cut(df["Age"],bins,labels=bin_labels)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    15-19
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (12, object): ['<10' < '10-14' < '15-19' < '20-24' ... '45-49' < '50-54' < '55-59' < '>60']

In [113]:
df_bins["Ages total"] = pd.cut(df["Age"],bins,labels=bin_labels)
df_bins.head()

0    15-19
1    35-39
2    20-24
3    20-24
4    20-24
Name: Age, dtype: object

In [81]:
# Average Purchase Price
df_group_age = df.groupby("Ages Total")
df_group_age["Price"].mean()

KeyError: 'Ages Total'

In [82]:
# Total Purchase Value
df_group_age["Price"].sum()

NameError: name 'df_group_age' is not defined

In [93]:
# Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
# SN
# Purchase Count
# Average Purchase Price
# Total Purchase Value
df_top_spend =df.groupby("SN")
total_top_spenders = pd.DataFrame(df_top_spend["Price"].sum())
total_top_spenders.head(5)

              Price
SN
Adairialis76   2.28
Adastirin33    4.48
Aeda94         4.91
Aela59         4.32
Aelaria33      1.79

In [98]:
#Identify the 5 most popular items by purchase count, then list (in a table):
df_top_item =df.groupby("Item ID")
total_top_items = pd.DataFrame(df_top_item["Purchase ID"].count())
total_top_items.head(5)

         Purchase ID
Item ID
0                  4
1                  4
2                  6
3                  6
4                  5

In [115]:
#Identify the 5 most profitable items by total purchase value, then list (in a table):

#Item ID
#Item Name
#Purchase Count
#Item Price
#Total Purchase Value

df_top_item_value =df.groupby("Item ID")
total_top_items_values = pd.DataFrame(df_top_item_value["Purchase ID"].sum())
total_top_items_values.head(5)

         Purchase ID
Item ID
0               1149
1               1523
2               2006
3               2087
4               1885